# Reading & Writing Data in Text Format

In [33]:
!cat /workspaces/Introduction-to-Data-Science/Pandas/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [1]:
import pandas as pd

In [35]:
df = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex1.csv")

In [36]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [37]:
!cat /workspaces/Introduction-to-Data-Science/Pandas/examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [38]:
pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [39]:
pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [40]:
names=["a", "b", "c", "d", "message"]

In [41]:
pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [42]:
!cat /workspaces/Introduction-to-Data-Science/Pandas/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [43]:
parsed = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/csv_mindex.csv", index_col=["key1","key2"])

In [44]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [45]:
 !cat /workspaces/Introduction-to-Data-Science/Pandas/examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [46]:
result = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex3.txt", sep="\s+")

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
/tmp/ipykernel_2201/4068437607.py:1: SyntaxWarning: invalid escape sequence '\s'
  result = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex3.txt", sep="\s+")

In [47]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [48]:
!cat /workspaces/Introduction-to-Data-Science/Pandas/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [49]:
pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [50]:
!cat /workspaces/Introduction-to-Data-Science/Pandas/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [51]:
result = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex5.csv")

In [52]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [53]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [54]:
result = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex5.csv", na_values=["NULL"])

In [55]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [56]:
result2 = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex5.csv", keep_default_na=False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [57]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [58]:
result3 = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex5.csv", keep_default_na=False, na_values=["NA"])
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [59]:
pd.options.display.max_rows = 10

In [60]:
result = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [61]:
result = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex6.csv", nrows=5)
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [62]:
chunker = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex6.csv", chunksize=1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [63]:
tot = pd.Series([], dtype='int64')

for pience in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

NameError: name 'piece' is not defined

In [36]:
tot = tot.sort_values(ascending=False)

In [37]:
tot[:10]

Series([], dtype: int64)

## Writing to Text Foramt

In [64]:
data = pd.read_csv("/workspaces/Introduction-to-Data-Science/Pandas/examples/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
data.to_csv("examples/out.csv")

In [41]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [65]:
import sys
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [66]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [67]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

### Delimited Formats

In [68]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [69]:
import csv

f = open("examples/ex7.csv")

reader = csv.reader(f)

In [70]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [71]:
f.close()

In [72]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [74]:
header, values = lines[0], lines[1:]

In [75]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### JSON Data

In [77]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [79]:
import json

In [81]:
result = json.loads(obj)

result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [82]:
asjson = json.dumps(result)

In [83]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [84]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [85]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [87]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [88]:
data = pd.read_json("examples/example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### XML & HTML: Web Scraping

In [90]:
pip install lxml beautifulsoup4 html5lib

Collecting lxml
  Downloading lxml-5.3.0-cp312-cp312-manylinux_2_28_x86_64.whl.metadata (3.8 kB)
Requirement already satisfied: beautifulsoup4 in /home/codespace/.local/lib/python3.12/site-packages (4.12.3)
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: soupsieve>1.2 in /home/codespace/.local/lib/python3.12/site-packages (from beautifulsoup4) (2.6)
Requirement already satisfied: six>=1.9 in /home/codespace/.local/lib/python3.12/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /home/codespace/.local/lib/python3.12/site-packages (from html5lib) (0.5.1)
Downloading lxml-5.3.0-cp312-cp312-manylinux_2_28_x86_64.whl (4.9 MB)
   â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 4.9/4.9 MB 32.6 MB/s eta 0:00:00
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Installing collected packages: lxml, html5lib
Successfully installed html5lib-1.1 lxml-5.3.0
Note: you may need to restart the kernel to use updated packages.

In [3]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [4]:
len(tables)

1

In [5]:
failures = tables[0]

In [6]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [8]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [10]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

# Binary Data Formats

In [11]:
frame = pd.read_csv("examples/ex1.csv")

In [12]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
frame.to_pickle("examples/frame_pickle")

In [14]:
pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Interacting with web APIs

In [15]:
pip install requests

Requirement already satisfied: requests in /home/codespace/.local/lib/python3.12/site-packages (2.32.3)
Requirement already satisfied: charset-normalizer<4,>=2 in /home/codespace/.local/lib/python3.12/site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /home/codespace/.local/lib/python3.12/site-packages (from requests) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /home/codespace/.local/lib/python3.12/site-packages (from requests) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in /home/codespace/.local/lib/python3.12/site-packages (from requests) (2024.8.30)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import requests

In [3]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [4]:
resp = requests.get(url)

In [5]:
resp.raise_for_status()

In [6]:
resp

In [7]:
data = resp.json()

In [8]:
data[0]["title"]

'ENH: Be able to add lines for all index levels, not just visible ones [fix #59877]'

In [9]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])
issues

,number,title,labels,state
0,59916,ENH: Be able to add lines for all index levels...,[],open
1,59915,"BUG: ""Columns must be same length as key"" exce...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,59914,DOC: fix pandas.TimedeltaIndex.to_pytimedelta ...,[],open
3,59913,BUG: SparseFrameAccessor.to_dense ignores _con...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,59911,DOC: Fix documentation's pandas.Series.compare...,[],open
5,59910,CI: fix wrong syntax in CI env yml files (mamb...,[],open
6,59909,ENH: set __module__ for objects in pandas pd.C...,[],open
7,59908,BUG: user defined function does not work with ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,59907,"BUG: pd.eval with engine=""numexpr"" fails with ...",[],open
9,59906,BLD: Fix armv7 build,[],open
10,59905,BUILD: Install regression on armv7,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,59904,BUG: pd.read_csv date parsing not working with...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,59902,BUG: Timedelta.ceil throws error when used wi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,59901,BUG: Raise TypeError when subracting DateTimeA...,[],open
14,59900,Improve error mesage verbosity,[],open
15,59899,BUG:,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,59897,"ENH: Describe : add shortest, longest, avg/max...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
17,59895,REF: make _cast_pointwise_result an EA method,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
18,59890,DOC: Should `DataFrame.drop()` accept a `set` ...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
19,59889,Fixed #59592,[],open
20,59888,BUG: select_dtypes does not work with timestam...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,59887,BUG: drop_duplicates() inconsistent output whe...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,59886,BUG: df.to_sql() shows a case sensitive behavi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
23,59884,BUG: Disabling pandas option display.html.use_...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,59883,BUG: Arrow Binary View Types Don't Print When ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,59882,BUG: When using to_excel() columns with Date F...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,59880,DOC: defaults in method signature vs description,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,59879,BUG (string dtype): looking up missing value i...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,59878,DOC: Add doc for `series.dt.to_timestamp` & re...,[],open
29,59877,ENH: Adding `\cline`s to LaTeX table if index ...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open

# Interacting with Databases

In [10]:
import sqlite3

In [11]:
query = """
        CREATE TABLE test
        (a VARCHAR(20), b VARCHAR(20),
        c REAL, d INTEGER);
"""

In [12]:
con = sqlite3.connect("mydata.sqlite")

In [13]:
con.execute(query)

In [14]:
con.commit()

In [15]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        "Sacramento", "California", 1.7, 5]

In [18]:
stmt = "INSERT INTO test VALUES=(?,?,?,?)"

In [20]:
con.executemany(stmt, data)

OperationalError: near "=": syntax error